#include <REGX52.H>
#include "Delay.h"
#include "Timer0.h"

sbit Buzzer = P2^5;

#define P	0	//休止符
#define L1	1	//L表示低音
#define L1_	2	//_表示升半音 即#1
#define L2	3
#define L2_	4
#define L3	5
#define L4	6
#define L4_	7
#define L5	8
#define L5_	9
#define L6	10
#define L6_	11
#define L7	12
#define M1	13	//M表示中音
#define M1_	14
#define M2	15
#define M2_	16
#define M3	17
#define M4	18
#define M4_	19
#define M5	20
#define M5_	21
#define M6	22
#define M6_	23
#define M7	24
#define H1	25	//H表示高音
#define H1_	26
#define H2	27
#define H2_	28
#define H3	29
#define H4	30
#define H4_	31
#define H5	32
#define H5_	33
#define H6	34
#define H6_	35
#define H7	36
#define STOP 37

unsigned int FreqTable[] = {
	0,
	63777,63872,63969,64054,64140,64216,64291,64360,64426,64489,64547,64603,
	64655,64704,64751,64795,64837,64876,64913,64948,64981,65012,65042,65070,
	65095,65120,65144,65166,65186,65206,65225,65242,65259,65274,65289,65303
};

unsigned char code Music[][2] = {	//后一位表示时长，1为半拍
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},{P,2},
	{M3,4},{M2,2},{M1,4},{M2,2},{M3,3},{M4,1},{M3,2},{M2,4},
	{M1,1},{M2,1},{M3,2},{M3,2},{M2,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,2},{M1,1},{M1,1},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{M2,1},{M3,6},{P,6},
		//悴んだ心 ふるえる眼差し 世界で
	{M3,2},{M5,2},{H1,1},{H1,1},{M7,4},{H1,2},{M7,4},{H1,2},{M7,1},{M6,1},{M5,2},{P,2},
		//僕は ひとりぼっちだった
	{M5,2},{M2,2},{M4,2},{M4,4},{M3,2},{M3,2},{P,2},{L5,2},{M4,2},{M3,2},{M2,2},{M3,4},{M5,2},{M1,6},
		//散ることしか知らない春は
	{P,4},{M1,2},{M2,2},{M1,3},{M1,1},{M1,2},{M5,2},{M1,2},{M4,4},{M3,2},{M2,4},{M1,2},{M1,6},
		//毎年冷たくあしらう
	{P,4},{M1,1},{M2,1},{M3,2},{M3,2},{M2,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,2},{M1,1},{M1,1},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{M2,1},{M3,6},{P,6},
		//暗がりの中 一方通行に ただた だ
	{M3,2},{M5,2},{H1,2},{M7,4},{H1,2},{M7,4},{H1,2},{M7,1},{M6,1},{M5,2},{P,2},
		//言葉を書き殴って
	{M5,2},{M2,2},{M4,2},{M4,4},{M3,2},{M3,2},{P,2},{L5,2},{M4,2},{M3,2},{M2,2},{M3,4},{M5,2},{M1,10},{M1,1},{M1,1},{M2,2},{M1,2},{P,2},
		//期待するだけ むなしいと分かっていても
	{M1,2},{M5,2},{M1,2},{M4,2},{M4,1},{M4,1},{M3,1},{M2,1},{M2,4},{M1,2},{M1,6},{P,6},
		//救いを求め続けた
	{M6,2},{M5,2},{M5,2},{M5,2},{M4,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,4},
		//せつなくて いとおしい
	{M5,2},{M5,2},{M4,1},{M4,1},{M4,2},{M4,2},{M3,2},{M2,2},{M2,4},{M1,1},{L7,1},{M1,4},{P,2},
		//今ならば 分かる気がする
	{M6,2},{M5,2},{M5,2},{M5,2},{M4,2},{M4,2},{M3,2},{M2,2},{M2,2},{M2,4},
		//しあわせで くるおしい
	{M2,2},{M3,2},{M3,1},{M3,1},{M3,1},{M3,1},{M3,2},{M2,2},{M3,2},{H2,4},{H1,2},{H1,2},{P,2},
		//あの日泣けなかった僕を
	{H1,2},{M7,4},{M6,2},{M6,6},{P,4},{M6,2},{M6,2},{M5,2},{M4,1},{M4,1},{M4,6},{M3,1},{M4,1},{M5,10},{P,6},
		//光は やさしく連れ立つよ
	{M3,1},{M2,1},{M3,1},{M2,1},{M3,1},{M4,1},{M5,4},{M4,1},{M5,1},{M6,4},{M6,1},{M7,1},{H1,2},{P,2},
		//雲間をぬって きらりきらり
	{H2,1},{H1,1},{M5,4},{M1,2},{M5,2},{M4,2},{M3,2},{M3,4},{M3,1},{M3,1},{M5,4},{P,2},
		//心満たしては 溢れ
	{M3,1},{M2,1},{M3,1},{M2,1},{M3,1},{M4,1},{M5,4},{M4,1},{M5,1},{M6,4},{M6,1},{M7,1},{H1,2},{P,2},
		//いつしか頬を きらりきらり
	{H1,1},{H3,2},{H3,2},{P,1},{H2,1},{H4,2},{H3,2},{H2,2},{H2,3},{H1,1},{H1,1},{M7,1},{H1,2},{P,2},
		//熱く 熱く濡らしてゆく
	{M5,1},{H1,1},{H2,4},{H1,2},{H1,2},{P,2},{M5,2},{H2,4},{H1,2},{H1,2},{P,2},
		//君の手は どうして
	{M5,1},{H1,1},{H2,4},{H1,2},{H1,2},{P,2},{M5,1},{H1,1},{H2,3},{H3,1},{H2,2},{H1,2},{P,2},
		//こんなにも温かいの？
	{H1,2},{H1,4},{M6,2},{M6,4},{M5,2},{M5,4},{M4,2},{M4,2},{M3,2},{M2,2},{M3,6},{P,6},{M3,2},{M4,2},{M3,2},{M4,2},{M3,2},{M2,2},{M1,6},
		//ねぇお願い どうかこのまま 離さないでいて
	{STOP,1}

};

unsigned char FreqSelect,MusicSelect;

void main(){
	Timer0_Init();
	while(1){
		if(FreqSelect == STOP){	//判断停止
			TR0 = 0;
			while(1);
		}
		else{
			FreqSelect = Music[MusicSelect][0];
			Delay(140 * Music[MusicSelect][1]); // 194BPM (60/194)/2=0.155s 155有点慢不懂为啥。。140差不多但还得调整
			MusicSelect++;
			
			TR0 = 0;	//音符之间间断
			Delay(5);
			TR0 = 1;
		}
	}
}

void Timer0_Routine() interrupt 1{
	if(FreqTable[FreqSelect]){
		TH0 = FreqTable[FreqSelect] / 256;
		TL0 = FreqTable[FreqSelect] % 256;
		Buzzer = !Buzzer;
	}
}

